Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/educational_supports/index.html.txt.tmx
Source language: en
Languages: ga

source: Equipment grants for students with disabilities
ga: Deontais trealaimh do scoláirí le riachtanaisí speisealta

source: This document describes a scheme that provides a grant to schools to allow them to buy equipment for students with disabilities at post-primary level
ga: Tá cur síos anseo ar scéim a chuireann deontas ar fáil do scoileanna chun cur ar an gcumas treallamh a cheannacht do scolairí faoi mhíchumas

source: Financial help with going to school
ga: Tacaíocht airgeadais le dul ar scoil

source: There are several schemes to help with the costs of going to school
ga: Tá roinnt scéimeanna i bhfeidhm chun cabhrú leis na costais a bhaineann le freastal ar scoil

source: The Department of Education and Skills operates a Visiting Teacher Service for deaf children and children with visual impairments
ga: Oibríonn an Roinn Oideachais agus Scileanna seirbhís mhúinteora ar cuairt le haghaidh páistí bodhra nó lagéisteachta agus páistí le lagú amhairc

source: Resources for non-English-speaking pupils
ga: Acmhainní do dhaltaí nach cainteoirí Béarla iad

source: This document describes the educational supports for non-English-speaking students in primary and post-primary schools
ga: Tugann an cháipéis seo cur síos ar an tacaíocht oideachais le haghaidh daltaí nach cainteoirí Béarla iad i mbunscoileanna agus in iar-bhunscoileanna

source: Psychological services for schools
ga: Seirbhís síceolaíochta i scoileanna

source: The National Educational Psychological Service provides psychological services in primary and post-primary schools
ga: Cuireann an tSeirbhís Náisiúnta Síceolaíochta Oideachais seirbhísí síceolaíochta ar fáil i mbunscoileanna agus in iar-bhunscoileanna

source: Educational arrangements for Travellers
ga: Socraithe oideachais don Lucht Siúil

source: This document privide information on the arrangements in place for the education of Traveller children
ga: Cur síos ar na socraithe oideachais atá ar fáil do pháistí an lucht siúil

source: There are a number of education schemes for young people and others who have left school without a recognised qualification
ga: Tá roinnt scéimeanna oideachais ann do dhaoine óga agus do dhaoine eile a d'fhág an scoil gan aon cháilíocht aitheanta

source: Schools and information technology
ga: Scoileanna agus teicneolaíocht faisnéise

source: This document outlines the development and support of information and communications technology in schools
ga: Tugtar breac-chuntas sa cháipéis seo ar fhorbairt agus ar thacaíocht le teicneolaíocht faisnéise agus cumarsáide i scoileanna

source: Most Read in "Education and Training"
ga: Ábhar is mó éilimh i "Oideachas agus Oiliúint"

source: School terms in primary and post-primary schools
ga: Téarmaí scoile i mbunscoileanna agus iarbhunscoileanna

source: Further Education and Training (FET) allowances
ga: Liúntais Bhreisoideachais agus Oiliúna (BOO)
